OurDreams/mx207/mxapp/bsp/board/mx207/stm32f2xxeth.h
    uint32_t ETH_HashTableHigh; /*!< This field holds the higher 32 bits of Hash table.  */

    uint32_t ETH_HashTableLow; /*!< This field holds the lower 32 bits of Hash table.  */

    uint32_t ETH_PauseTime; /*!< This field holds the value to be used in the Pause Time field in the
     transmit control frame */

    uint32_t ETH_ZeroQuantaPause; /*!< Selects or not the automatic generation of Zero-Quanta Pause Control frames
     This parameter can be a value of @ref ETH_Zero_Quanta_Pause */

    uint32_t ETH_PauseLowThreshold; /*!< This field configures the threshold of the PAUSE to be checked for
     automatic retransmission of PAUSE Frame
     This parameter can be a value of @ref ETH_Pause_Low_Threshold */

    uint32_t ETH_UnicastPauseFrameDetect; /*!< Selects or not the MAC detection of the Pause frames (with MAC Address0
     unicast address and unique multicast address)
     This parameter can be a value of @ref ETH_Unicast_Pause_Frame_Detect */

    uint32_t ETH_ReceiveFlowControl; /*!< Enables or disables the MAC to decode the received Pause frame and
     disable its transmitter for a specified time (Pause Time)
     This parameter can be a value of @ref ETH_Receive_Flow_Control */

    uint32_t ETH_TransmitFlowControl; /*!< Enables or disables the MAC to transmit Pause frames (Full-Duplex mode)
     or the MAC back-pressure operation (Half-Duplex mode)
     This parameter can be a value of @ref ETH_Transmit_Flow_Control */

    uint32_t ETH_VLANTagComparison; /*!< Selects the 12-bit VLAN identifier or the complete 16-bit VLAN tag for
     comparison and filtering
     This parameter can be a value of @ref ETH_VLAN_Tag_Comparison */

    uint32_t ETH_VLANTagIdentifier; /*!< Holds the VLAN tag identifier for receive frames */

    /**
     * @brief / * DMA
     */

    uint32_t ETH_DropTCPIPChecksumErrorFrame; /*!< Selects or not the Dropping of TCP/IP Checksum Error Frames
     This parameter can be a value of @ref ETH_Drop_TCP_IP_Checksum_Error_Frame */

    uint32_t ETH_ReceiveStoreForward; /*!< Enables or disables the Receive store and forward mode
     This parameter can be a value of @ref ETH_Receive_Store_Forward */

    uint32_t ETH_FlushReceivedFrame; /*!< Enables or disables the flushing of received frames
     This parameter can be a value of @ref ETH_Flush_Received_Frame */

    uint32_t ETH_TransmitStoreForward; /*!< Enables or disables Transmit store and forward mode
     This parameter can be a value of @ref ETH_Transmit_Store_Forward */

    uint32_t ETH_TransmitThresholdControl; /*!< Selects or not the Transmit Threshold Control
     This parameter can be a value of @ref ETH_Transmit_Threshold_Control */

    uint32_t ETH_ForwardErrorFrames; /*!< Selects or not the forward to the DMA of erroneous frames
     This parameter can be a value of @ref ETH_Forward_Error_Frames */

    uint32_t ETH_ForwardUndersizedGoodFrames; /*!< Enables or disables the Rx FIFO to forward Undersized frames (frames with no Error
     and length less than 64 bytes) including pad-bytes and CRC)
     This parameter can be a value of @ref ETH_Forward_Undersized_Good_Frames */

    uint32_t ETH_ReceiveThresholdControl; /*!< Selects the threshold level of the Receive FIFO
     This parameter can be a value of @ref ETH_Receive_Threshold_Control */

    uint32_t ETH_SecondFrameOperate; /*!< Selects or not the Operate on second frame mode, which allows the DMA to process a second
     frame of Transmit data even before obtaining the status for the first frame.
     This parameter can be a value of @ref ETH_Second_Frame_Operate */

    uint32_t ETH_AddressAlignedBeats; /*!< Enables or disables the Address Aligned Beats
     This parameter can be a value of @ref ETH_Address_Aligned_Beats */

    uint32_t ETH_FixedBurst; /*!< Enables or disables the AHB Master interface fixed burst transfers
     This parameter can be a value of @ref ETH_Fixed_Burst */

    uint32_t ETH_RxDMABurstLength; /*!< Indicates the maximum number of beats to be transferred in one Rx DMA transaction
     This parameter can be a value of @ref ETH_Rx_DMA_Burst_Length */

    uint32_t ETH_TxDMABurstLength; /*!< Indicates the maximum number of beats to be transferred in one Tx DMA transaction
     This parameter can be a value of @ref ETH_Tx_DMA_Burst_Length */

    uint32_t ETH_DescriptorSkipLength; /*!< Specifies the number of word to skip between two unchained descriptors (Ring mode) */

    uint32_t ETH_DMAArbitration; /*!< Selects the DMA Tx/Rx arbitration
     This parameter can be a value of @ref ETH_DMA_Arbitration */
} ETH_InitTypeDef;

/**--------------------------------------------------------------------------**/
/** 
 * @brief                           DMA descriptors types
 */
/**--------------------------------------------------------------------------**/

/** 
 * @brief  ETH DMA Descriptors data structure definition
 */
typedef struct
{
    __IO uint32_t Status; /*!< Status */
    uint32_t ControlBufferSize; /*!< Control and Buffer1, Buffer2 lengths */
    uint32_t Buffer1Addr; /*!< Buffer1 address pointer */
    uint32_t Buffer2NextDescAddr; /*!< Buffer2 or next descriptor address pointer */
    /* Enhanced ETHERNET DMA PTP Descriptors */
#ifdef USE_ENHANCED_DMA_DESCRIPTORS
    uint32_t ExtendedStatus; /* Extended status for PTP receive descriptor */
    uint32_t Reserved1; /* Reserved */
    uint32_t TimeStampLow; /* Time Stamp Low value for transmit and receive */
    uint32_t TimeStampHigh; /* Time Stamp High value for transmit and receive */
#endif /* USE_ENHANCED_DMA_DESCRIPTORS */
} ETH_DMADESCTypeDef;

typedef struct
{
    u32 length;
    u32 buffer;
    __IO ETH_DMADESCTypeDef *descriptor;
} FrameTypeDef;

typedef struct
{
    __IO ETH_DMADESCTypeDef *FS_Rx_Desc; /*!< First Segment Rx Desc */
    __IO ETH_DMADESCTypeDef *LS_Rx_Desc; /*!< Last Segment Rx Desc */
    __IO uint32_t Seg_Count; /*!< Segment count */
} ETH_DMA_Rx_Frame_infos;

/**
 * @}
 */

/** @defgroup ETH_Exported_Constants
 * @{
 */

/**--------------------------------------------------------------------------**/
/** 
 * @brief                          ETH Frames defines
 */
/**--------------------------------------------------------------------------**/

