OurDreams/mx207/mxapp/bsp/board/mx207/stm32f2xxeth.h
#define IS_ETH_PTP_GET_FLAG(FLAG) (((FLAG) == ETH_PTP_FLAG_TSARU) || \
                                    ((FLAG) == ETH_PTP_FLAG_TSITE) || \
                                    ((FLAG) == ETH_PTP_FLAG_TSSTU) || \
                                    ((FLAG) == ETH_PTP_FLAG_TSSTI) || \
                                    ((FLAG) == ETH_PTP_FLAG_TSTTR) || \
                                    ((FLAG) == ETH_PTP_FLAG_TSSO)) 

/** 
 * @brief  ETH PTP subsecond increment
 */
#define IS_ETH_PTP_SUBSECOND_INCREMENT(SUBSECOND) ((SUBSECOND) <= 0xFF)

/**
 * @}
 */

/** @defgroup ETH_PTP_time_sign 
 * @{
 */
#define ETH_PTP_PositiveTime      ((uint32_t)0x00000000)  /*!< Positive time value */
#define ETH_PTP_NegativeTime      ((uint32_t)0x80000000)  /*!< Negative time value */
#define IS_ETH_PTP_TIME_SIGN(SIGN) (((SIGN) == ETH_PTP_PositiveTime) || \
                                    ((SIGN) == ETH_PTP_NegativeTime))

/** 
 * @brief  ETH PTP time stamp low update
 */
#define IS_ETH_PTP_TIME_STAMP_UPDATE_SUBSECOND(SUBSECOND) ((SUBSECOND) <= 0x7FFFFFFF)

/** 
 * @brief  ETH PTP registers
 */
#define ETH_PTPTSCR     ((uint32_t)0x00000700)  /*!< PTP TSCR register */
#define ETH_PTPSSIR     ((uint32_t)0x00000704)  /*!< PTP SSIR register */
#define ETH_PTPTSHR     ((uint32_t)0x00000708)  /*!< PTP TSHR register */
#define ETH_PTPTSLR     ((uint32_t)0x0000070C)  /*!< PTP TSLR register */
#define ETH_PTPTSHUR    ((uint32_t)0x00000710)  /*!< PTP TSHUR register */
#define ETH_PTPTSLUR    ((uint32_t)0x00000714)  /*!< PTP TSLUR register */
#define ETH_PTPTSAR     ((uint32_t)0x00000718)  /*!< PTP TSAR register */
#define ETH_PTPTTHR     ((uint32_t)0x0000071C)  /*!< PTP TTHR register */
#define ETH_PTPTTLR     ((uint32_t)0x00000720)  /* PTP TTLR register */

#define ETH_PTPTSSR     ((uint32_t)0x00000728)  /* PTP TSSR register */

#define IS_ETH_PTP_REGISTER(REG) (((REG) == ETH_PTPTSCR) || ((REG) == ETH_PTPSSIR) || \
                                   ((REG) == ETH_PTPTSHR) || ((REG) == ETH_PTPTSLR) || \
                                   ((REG) == ETH_PTPTSHUR) || ((REG) == ETH_PTPTSLUR) || \
                                   ((REG) == ETH_PTPTSAR) || ((REG) == ETH_PTPTTHR) || \
                                   ((REG) == ETH_PTPTTLR) || ((REG) == ETH_PTPTSSR)) 

/** 
 * @brief  ETHERNET PTP clock
 */
#define ETH_PTP_OrdinaryClock               ((uint32_t)0x00000000)  /* Ordinary Clock */
#define ETH_PTP_BoundaryClock               ((uint32_t)0x00010000)  /* Boundary Clock */
#define ETH_PTP_EndToEndTransparentClock    ((uint32_t)0x00020000)  /* End To End Transparent Clock */
#define ETH_PTP_PeerToPeerTransparentClock  ((uint32_t)0x00030000)  /* Peer To Peer Transparent Clock */

#define IS_ETH_PTP_TYPE_CLOCK(CLOCK) (((CLOCK) == ETH_PTP_OrdinaryClock) || \
                          ((CLOCK) == ETH_PTP_BoundaryClock) || \
                          ((CLOCK) == ETH_PTP_EndToEndTransparentClock) || \
                                      ((CLOCK) == ETH_PTP_PeerToPeerTransparentClock))
/** 
 * @brief  ETHERNET snapshot
 */
#define ETH_PTP_SnapshotMasterMessage          ((uint32_t)0x00008000)  /* Time stamp snapshot for message relevant to master enable */
#define ETH_PTP_SnapshotEventMessage           ((uint32_t)0x00004000)  /* Time stamp snapshot for event message enable */
#define ETH_PTP_SnapshotIPV4Frames             ((uint32_t)0x00002000)  /* Time stamp snapshot for IPv4 frames enable */
#define ETH_PTP_SnapshotIPV6Frames             ((uint32_t)0x00001000)  /* Time stamp snapshot for IPv6 frames enable */
#define ETH_PTP_SnapshotPTPOverEthernetFrames  ((uint32_t)0x00000800)  /* Time stamp snapshot for PTP over ethernet frames enable */
#define ETH_PTP_SnapshotAllReceivedFrames      ((uint32_t)0x00000100)  /* Time stamp snapshot for all received frames enable */

#define IS_ETH_PTP_SNAPSHOT(SNAPSHOT) (((SNAPSHOT) == ETH_PTP_SnapshotMasterMessage) || \
                           ((SNAPSHOT) == ETH_PTP_SnapshotEventMessage) || \
                           ((SNAPSHOT) == ETH_PTP_SnapshotIPV4Frames) || \
                           ((SNAPSHOT) == ETH_PTP_SnapshotIPV6Frames) || \
                           ((SNAPSHOT) == ETH_PTP_SnapshotPTPOverEthernetFrames) || \
                           ((SNAPSHOT) == ETH_PTP_SnapshotAllReceivedFrames))

/**
 * @}
 */
/* ETHERNET MAC address offsets */
#define ETH_MAC_ADDR_HBASE   (ETH_MAC_BASE + 0x40)  /* ETHERNET MAC address high offset */
#define ETH_MAC_ADDR_LBASE    (ETH_MAC_BASE + 0x44)  /* ETHERNET MAC address low offset */

/* ETHERNET MACMIIAR register Mask */
#define MACMIIAR_CR_MASK    ((uint32_t)0xFFFFFFE3)

/* ETHERNET MACCR register Mask */
#define MACCR_CLEAR_MASK    ((uint32_t)0xFF20810F)  

/* ETHERNET MACFCR register Mask */
#define MACFCR_CLEAR_MASK   ((uint32_t)0x0000FF41)

/* ETHERNET DMAOMR register Mask */
#define DMAOMR_CLEAR_MASK   ((uint32_t)0xF8DE3F23)

/* ETHERNET Remote Wake-up frame register length */
#define ETH_WAKEUP_REGISTER_LENGTH      8

/* ETHERNET Missed frames counter Shift */
#define  ETH_DMA_RX_OVERFLOW_MISSEDFRAMES_COUNTERSHIFT     17

/* ETHERNET DMA Tx descriptors Collision Count Shift */
#define  ETH_DMATXDESC_COLLISION_COUNTSHIFT        3

/* ETHERNET DMA Tx descriptors Buffer2 Size Shift */
#define  ETH_DMATXDESC_BUFFER2_SIZESHIFT           16

/* ETHERNET DMA Rx descriptors Frame Length Shift */
#define  ETH_DMARXDESC_FRAME_LENGTHSHIFT           16

/* ETHERNET DMA Rx descriptors Buffer2 Size Shift */
#define  ETH_DMARXDESC_BUFFER2_SIZESHIFT           16

/* ETHERNET errors */
#define  ETH_ERROR              ((uint32_t)0)
#define  ETH_SUCCESS            ((uint32_t)1)

/**
 * @}
 */

/** @defgroup ETH_Exported_Macros
 * @{
 */
/**
 * @}
 */

/** @defgroup ETH_Exported_Functions
 * @{
 */
void
ETH_DeInit(void);
uint32_t
ETH_Init(ETH_InitTypeDef* ETH_InitStruct, uint16_t PHYAddress);
void
ETH_StructInit(ETH_InitTypeDef* ETH_InitStruct);
void
ETH_SoftwareReset(void);
FlagStatus
ETH_GetSoftwareResetStatus(void);
void
ETH_Start(void);
uint32_t
ETH_GetRxPktSize(ETH_DMADESCTypeDef *DMARxDesc);

#ifdef USE_ENHANCED_DMA_DESCRIPTORS
void
ETH_EnhancedDescriptorCmd(FunctionalState NewState);
#endif /* USE_ENHANCED_DMA_DESCRIPTORS */

/** 
 * @brief  PHY
 */
uint16_t
ETH_ReadPHYRegister(uint16_t PHYAddress, uint16_t PHYReg);
uint32_t
ETH_WritePHYRegister(uint16_t PHYAddress, uint16_t PHYReg, uint16_t PHYValue);
uint32_t
ETH_PHYLoopBackCmd(uint16_t PHYAddress, FunctionalState NewState);

/** 
 * @brief  MAC
 */
void
ETH_MACTransmissionCmd(FunctionalState NewState);
void
ETH_MACReceptionCmd(FunctionalState NewState);
FlagStatus
ETH_GetFlowControlBusyStatus(void);
void
ETH_InitiatePauseControlFrame(void);
void
ETH_BackPressureActivationCmd(FunctionalState NewState);
FlagStatus
ETH_GetMACFlagStatus(uint32_t ETH_MAC_FLAG);
ITStatus
ETH_GetMACITStatus(uint32_t ETH_MAC_IT);
void
ETH_MACITConfig(uint32_t ETH_MAC_IT, FunctionalState NewState);
void
ETH_MACAddressConfig(uint32_t MacAddr, uint8_t *Addr);
void
ETH_GetMACAddress(uint32_t MacAddr, uint8_t *Addr);
void
ETH_MACAddressPerfectFilterCmd(uint32_t MacAddr, FunctionalState NewState);
void
ETH_MACAddressFilterConfig(uint32_t MacAddr, uint32_t Filter);
void
ETH_MACAddressMaskBytesFilterConfig(uint32_t MacAddr, uint32_t MaskByte);

/** 
 * @brief  DMA Tx/Rx descriptors
 */
void
ETH_DMARxDescChainInit(ETH_DMADESCTypeDef *DMARxDescTab, uint8_t *RxBuff,
        uint32_t RxBuffCount);
void
ETH_DMATxDescChainInit(ETH_DMADESCTypeDef *DMATxDescTab, uint8_t* TxBuff,
        uint32_t TxBuffCount);
uint32_t
ETH_CheckFrameReceived(void);
uint32_t
ETH_Prepare_Transmit_Descriptors(u16 FrameLength);
FrameTypeDef
ETH_Get_Received_Frame(void);
FlagStatus
ETH_GetDMATxDescFlagStatus(ETH_DMADESCTypeDef *DMATxDesc,
        uint32_t ETH_DMATxDescFlag);
uint32_t
ETH_GetDMATxDescCollisionCount(ETH_DMADESCTypeDef *DMATxDesc);
void
ETH_SetDMATxDescOwnBit(ETH_DMADESCTypeDef *DMATxDesc);
void
ETH_DMATxDescTransmitITConfig(ETH_DMADESCTypeDef *DMATxDesc,
        FunctionalState NewState);
void
ETH_DMATxDescFrameSegmentConfig(ETH_DMADESCTypeDef *DMATxDesc,
        uint32_t DMATxDesc_FrameSegment);
void
ETH_DMATxDescChecksumInsertionConfig(ETH_DMADESCTypeDef *DMATxDesc,
        uint32_t DMATxDesc_Checksum);
void
ETH_DMATxDescCRCCmd(ETH_DMADESCTypeDef *DMATxDesc, FunctionalState NewState);
void
ETH_DMATxDescSecondAddressChainedCmd(ETH_DMADESCTypeDef *DMATxDesc,
        FunctionalState NewState);
void
ETH_DMATxDescShortFramePaddingCmd(ETH_DMADESCTypeDef *DMATxDesc,
        FunctionalState NewState);
void
ETH_DMATxDescBufferSizeConfig(ETH_DMADESCTypeDef *DMATxDesc,
        uint32_t BufferSize1, uint32_t BufferSize2);
FlagStatus
ETH_GetDMARxDescFlagStatus(ETH_DMADESCTypeDef *DMARxDesc,
        uint32_t ETH_DMARxDescFlag);
#ifdef USE_ENHANCED_DMA_DESCRIPTORS
FlagStatus
ETH_GetDMAPTPRxDescExtendedFlagStatus(ETH_DMADESCTypeDef *DMAPTPRxDesc,
        uint32_t ETH_DMAPTPRxDescExtendedFlag);
#endif /* USE_ENHANCED_DMA_DESCRIPTORS */
void
ETH_SetDMARxDescOwnBit(ETH_DMADESCTypeDef *DMARxDesc);
uint32_t
ETH_GetDMARxDescFrameLength(ETH_DMADESCTypeDef *DMARxDesc);
void
ETH_DMARxDescReceiveITConfig(ETH_DMADESCTypeDef *DMARxDesc,
        FunctionalState NewState);
void
ETH_DMARxDescSecondAddressChainedCmd(ETH_DMADESCTypeDef *DMARxDesc,
        FunctionalState NewState);
uint32_t
ETH_GetDMARxDescBufferSize(ETH_DMADESCTypeDef *DMARxDesc,
        uint32_t DMARxDesc_Buffer);
FrameTypeDef
ETH_Get_Received_Frame_interrupt(void);
/** 
 * @brief  DMA
 */
FlagStatus
ETH_GetDMAFlagStatus(uint32_t ETH_DMA_FLAG);
void
ETH_DMAClearFlag(uint32_t ETH_DMA_FLAG);
ITStatus
ETH_GetDMAITStatus(uint32_t ETH_DMA_IT);
void
ETH_DMAClearITPendingBit(uint32_t ETH_DMA_IT);
uint32_t
ETH_GetTransmitProcessState(void);
uint32_t
ETH_GetReceiveProcessState(void);
void
ETH_FlushTransmitFIFO(void);
FlagStatus
ETH_GetFlushTransmitFIFOStatus(void);
void
ETH_DMATransmissionCmd(FunctionalState NewState);
void
ETH_DMAReceptionCmd(FunctionalState NewState);
void
ETH_DMAITConfig(uint32_t ETH_DMA_IT, FunctionalState NewState);
FlagStatus
ETH_GetDMAOverflowStatus(uint32_t ETH_DMA_Overflow);
uint32_t
ETH_GetRxOverflowMissedFrameCounter(void);
uint32_t
ETH_GetBufferUnavailableMissedFrameCounter(void);
uint32_t
ETH_GetCurrentTxDescStartAddress(void);
uint32_t
ETH_GetCurrentRxDescStartAddress(void);
uint32_t
ETH_GetCurrentTxBufferAddress(void);
uint32_t
ETH_GetCurrentRxBufferAddress(void);
void
ETH_ResumeDMATransmission(void);
void
ETH_ResumeDMAReception(void);
void
ETH_SetReceiveWatchdogTimer(uint8_t Value);

/** 
 * @brief  PMT
 */
void
ETH_ResetWakeUpFrameFilterRegisterPointer(void);
void
ETH_SetWakeUpFrameFilterRegister(uint32_t *Buffer);
void
ETH_GlobalUnicastWakeUpCmd(FunctionalState NewState);
FlagStatus
ETH_GetPMTFlagStatus(uint32_t ETH_PMT_FLAG);
void
ETH_WakeUpFrameDetectionCmd(FunctionalState NewState);
void
ETH_MagicPacketDetectionCmd(FunctionalState NewState);
void
ETH_PowerDownCmd(FunctionalState NewState);

/** 
 * @brief  MMC
 */
void
ETH_MMCCounterFullPreset(void);
void
ETH_MMCCounterHalfPreset(void);
void
ETH_MMCCounterFreezeCmd(FunctionalState NewState);
void
ETH_MMCResetOnReadCmd(FunctionalState NewState);
void
ETH_MMCCounterRolloverCmd(FunctionalState NewState);
void
ETH_MMCCountersReset(void);
void
ETH_MMCITConfig(uint32_t ETH_MMC_IT, FunctionalState NewState);
ITStatus
ETH_GetMMCITStatus(uint32_t ETH_MMC_IT);
uint32_t
ETH_GetMMCRegister(uint32_t ETH_MMCReg);

#ifdef __cplusplus
}
#endif

#endif /* __STM32F2x7_ETH_H */
/**
 * @}
 */

/**
 * @}
 */

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
